/*
 * tool.c
 *
 *  Created on: 2024年8月27日
 *      Author: FZY_YQH
 */

#include "zf_common_headfile.h"

int16 test = 0;

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     限制范围
// 参数说明     value
// 参数说明     min
// 参数说明     max
// 返回类型     int
// 使用示例     my_limit(min, max);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
int my_limit(int value, int min, int max)
{
    if (min < max)
    {
        if (value <= min)
        {
            value = min;
        }
        if (value >= max)
        {
            value = max;
        }
    }

    return value;
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介
// 参数说明
// 参数说明
// 参数说明
// 返回类型
// 使用示例
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
int my_abs(int value)
{
    if (value < 0)
    {
        return -value;
    }
    else
    {
        return value;
    }
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介
// 参数说明
// 参数说明
// 参数说明
// 返回类型
// 使用示例
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void circle_point(uint16 y, uint16 x)
{
    for (uint16 i = y - 5; i <= y + 5; i++)
    {
        ips200_draw_point(x - 5, i, RGB565_PURPLE);
        ips200_draw_point(x + 5, i, RGB565_PURPLE);
    }

    for (uint16 j = x - 5; j <= x + 5; j++)
    {
        ips200_draw_point(j, y - 5, RGB565_PURPLE);
        ips200_draw_point(j, y + 5, RGB565_PURPLE);
    }
}
